In [2]:
import numpy as np
import pandas as pd

In [3]:
#Importamos csv
df=pd.read_csv('HR RAW DATA.csv')
df.head()

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [4]:
#Creamos nueva variable para guardar la selecciÃ³n del rango de columnas que queremos.
#Este serÃ¡ nuestro csv
df_data=df.iloc[:, 1:]
df_data

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [5]:
#Visualizamos la informaciÃ³n bÃ¡sica del DataFram
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 517.1+ KB

In [7]:
#Exportamos el csv
df_data.to_csv('hr_data.csv', index=False)

In [8]:
#celda marga

In [9]:
#celda sharon

In [10]:
#celda isa

In [5]:
#celda silvia 

df_data

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [6]:
pd.set_option('display.max_columns', None)

In [7]:
df_data

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [8]:
df_data.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'employeecount',
       'employeenumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NUMCOMPANIESWORKED',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TOTALWORKINGYEARS', 'TrainingTimesLastYear', 'WORKLIFEBALANCE',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YEARSWITHCURRMANAGER', 'SameAsMonthlyIncome', 'DateBirth', 'Salary',
       'RoleDepartament', 'NUMBERCHILDREN', 'RemoteWork'],
      dtype='object')

In [9]:
df_data.iloc[:, 30:]

,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [10]:
#otra forma de hacerlo: 

df_data.iloc[:, -11:]

,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [9]:
#otra forma de hacerlo: 

df_silvia=df_data.loc[:, "WORKLIFEBALANCE":"RemoteWork"]

In [10]:
df_silvia

,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [35]:
df_silvia.to_csv("seleccion_silvia.csv", index=False)

In [11]:
df_silvia.describe()

,YearsAtCompany,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,DateBirth,NUMBERCHILDREN
count,1614.000000,1614.000000,1614.000000,1614.000000,0.0
mean,7.132590,2.245973,4.220570,1986.076208,NaN
std,6.124237,3.235665,3.562695,9.101332,NaN
min,0.000000,0.000000,0.000000,1963.000000,NaN
25%,3.000000,0.000000,2.000000,1980.000000,NaN
50%,5.000000,1.000000,3.000000,1987.000000,NaN
75%,9.000000,3.000000,7.000000,1993.000000,NaN
max,40.000000,15.000000,17.000000,2005.000000,NaN

In [12]:
df_silvia.describe(include="object")

,WORKLIFEBALANCE,YearsInCurrentRole,SameAsMonthlyIncome,Salary,RoleDepartament,RemoteWork
count,1506,34,771,1614,302,1614
unique,4,10,668,1,301,5
top,"3,0","2,0","6347,0",1000000000$,MaNAgeR - Sales,1
freq,913,11,4,1614,2,360

In [13]:
df_silvia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   WORKLIFEBALANCE          1506 non-null   object
 1   YearsAtCompany           1614 non-null   int64
 2   YearsInCurrentRole       34 non-null     object
 3   YearsSinceLastPromotion  1614 non-null   int64
 4   YEARSWITHCURRMANAGER     1614 non-null   int64
 5   SameAsMonthlyIncome      771 non-null    object
 6   DateBirth                1614 non-null   int64
 7   Salary                   1614 non-null   object
 8   RoleDepartament          302 non-null    object
 9   NUMBERCHILDREN           0 non-null      float64
 10  RemoteWork               1614 non-null   object
dtypes: float64(1), int64(4), object(6)
memory usage: 138.8+ KB

In [ ]:
# patron regx del proyecto pasado para separar donde encuentre una minuscula seguida de una mayuscula 
# re.sub(r'([a-z])([A-Z])', r'\1, \2', guionistas_peli)

In [14]:
df_silvia.columns= df_silvia.columns.str.replace(pat=r'([a-z])([A-Z])', repl= r'\1_\2', regex=True)

In [15]:
df_silvia

,WORKLIFEBALANCE,Years_At_Company,Years_In_Current_Role,Years_Since_Last_Promotion,YEARSWITHCURRMANAGER,Same_As_Monthly_Income,Date_Birth,Salary,Role_Departament,NUMBERCHILDREN,Remote_Work
0,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [16]:
df_silvia.columns=df_silvia.columns.str.lower()

In [17]:
df_silvia

,worklifebalance,years_at_company,years_in_current_role,years_since_last_promotion,yearswithcurrmanager,same_as_monthly_income,date_birth,salary,role_departament,numberchildren,remote_work
0,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

Cambiae manualmente los nombres de columna que no se han separado aun

In [18]:
df_silvia=df_silvia.rename(columns={"worklifebalance":"work_life_balance","yearswithcurrmanager":"years_with_current_manager","numberchildren":"number_children" })

In [148]:
#df_silvia=df_silvia.rename(columns={"years_with_currmanager":"years_with_current_manager"})

In [19]:
df_silvia

,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_current_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

Unificamos tipos de datos en la columna remote_work

In [20]:
df_silvia["remote_work"]

0         Yes
1           1
2           1
3       False
4           0
        ...
1609        0
1610        1
1611      Yes
1612     True
1613        0
Name: remote_work, Length: 1614, dtype: object

In [21]:
# Analizamos todos los valores unicos que tiene la columna para saber cuales tenemos que cambiar y como

df_silvia["remote_work"].unique()

array(['Yes', '1', 'False', '0', 'True'], dtype=object)

In [22]:
df_silvia["remote_work"].isnull().sum()

0

In [ ]:
# DE MANERA INDIVIDUAL 1 A 1:

In [107]:
# OTRA MANERA DE HACERLO:

replacement_dict = {'yes': True, 'Yes': True,'no': False,'No': False,'true': True,'false': False, "1": True, "0": False}


df_silvia['remote_work'].replace(replacement_dict)

0         Yes
1           1
2           1
3       False
4           0
        ...
1609        0
1610        1
1611      Yes
1612     True
1613        0
Name: remote_work, Length: 1614, dtype: object

In [23]:
# OTRA MANERA DE HACERLO DENTRO DE UNA FUNCION:

def convierto_boolean(remote_work):

    if remote_work in ('True','yes', 'Yes', '1', 'true'):

        return 'Yes' 
    
    elif remote_work in ('False','no', 'No', '0', 'false'):
        return 'No'
    
    else:
        return np.nan

In [25]:
df_silvia["remote_work"]=df_silvia["remote_work"].apply(convierto_boolean)

In [26]:
# COMPROBAMOS:

df_silvia

,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_current_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,Yes
2,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,Yes
3,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,No
4,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,No
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,No
1610,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,Yes
1611,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,Yes
1613,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,No

In [27]:
print(df_silvia['remote_work'].unique())

['Yes' 'No']

Convertimos los valores a booleano

In [120]:

# df_silvia['remote_work']=df_silvia['remote_work'].astype(bool)

In [151]:
df_silvia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   work_life_balance           1506 non-null   object
 1   years_at_company            1614 non-null   int64
 2   years_in_current_role       34 non-null     object
 3   years_since_last_promotion  1614 non-null   int64
 4   years_with_current_manager  1614 non-null   int64
 5   same_as_monthly_income      771 non-null    object
 6   date_birth                  1614 non-null   int64
 7   salary                      1614 non-null   object
 8   role_departament            302 non-null    object
 9   number_children             0 non-null      float64
 10  remote_work                 1614 non-null   object
dtypes: float64(1), int64(4), object(6)
memory usage: 138.8+ KB

In [150]:
df_silvia.to_csv("seleccion_silvia_edit.csv", index=False)

Convertir a minÃºsculas los valores de role_departament

In [28]:
df_silvia["role_departament"]=df_silvia["role_departament"].str.lower()

In [29]:
df_silvia

,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_current_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,Yes
2,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,manager - research & development,NaN,Yes
3,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,No
4,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,No
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,No
1610,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,Yes
1611,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,Yes
1613,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,No

In [30]:
df_silvia["role_departament"].unique()

array([nan, ' manager  -  research & development ',
       ' healthcare representative  -  research & development ',
       ' sales executive  -  sales ',
       ' laboratory technician  -  research & development ',
       ' manufacturing director  -  research & development ',
       ' research scientist  -  research & development ',
       ' research director  -  research & development ',
       ' human resources  -  human resources ', ' manager  -  sales ',
       ' sales representative  -  sales ',
       ' manager  -  human resources '], dtype=object)

Quitamos los espacios innecesarios que hay antes y despues de cada object:

In [31]:
df_silvia["role_departament"]=df_silvia["role_departament"].str.strip()

In [32]:
df_silvia["role_departament"].unique()

array([nan, 'manager  -  research & development',
       'healthcare representative  -  research & development',
       'sales executive  -  sales',
       'laboratory technician  -  research & development',
       'manufacturing director  -  research & development',
       'research scientist  -  research & development',
       'research director  -  research & development',
       'human resources  -  human resources', 'manager  -  sales',
       'sales representative  -  sales', 'manager  -  human resources'],
      dtype=object)

In [156]:
df_silvia.to_csv("seleccion_silvia_edit.csv", index=False)








CAMBIAR TIPO DE DATOS

In [33]:
# Cambiamos object --> float a la columna "same_as_monthly_income":

df_silvia["same_as_monthly_income"]=df_silvia["same_as_monthly_income"].str.replace(',', '.').astype(float)

In [34]:
df_silvia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   work_life_balance           1506 non-null   object
 1   years_at_company            1614 non-null   int64
 2   years_in_current_role       34 non-null     object
 3   years_since_last_promotion  1614 non-null   int64
 4   years_with_current_manager  1614 non-null   int64
 5   same_as_monthly_income      771 non-null    float64
 6   date_birth                  1614 non-null   int64
 7   salary                      1614 non-null   object
 8   role_departament            302 non-null    object
 9   number_children             0 non-null      float64
 10  remote_work                 1614 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 138.8+ KB

In [35]:
# Cambiamos columna years_in_current_role:

df_silvia["years_in_current_role"]=df_silvia["years_in_current_role"].str.replace(',', '.').astype(float)

In [36]:
df_silvia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   work_life_balance           1506 non-null   object
 1   years_at_company            1614 non-null   int64
 2   years_in_current_role       34 non-null     float64
 3   years_since_last_promotion  1614 non-null   int64
 4   years_with_current_manager  1614 non-null   int64
 5   same_as_monthly_income      771 non-null    float64
 6   date_birth                  1614 non-null   int64
 7   salary                      1614 non-null   object
 8   role_departament            302 non-null    object
 9   number_children             0 non-null      float64
 10  remote_work                 1614 non-null   object
dtypes: float64(3), int64(4), object(4)
memory usage: 138.8+ KB

In [37]:
# Cambiamos tipo de dato de object --> int de salary:

df_silvia["salary"]=df_silvia["salary"].str.replace('$', '').astype(float)

/tmp/ipykernel_15501/1793800080.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_silvia["salary"]=df_silvia["salary"].str.replace('$', '').astype(float)

In [39]:
df_silvia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   work_life_balance           1506 non-null   object
 1   years_at_company            1614 non-null   int64
 2   years_in_current_role       34 non-null     float64
 3   years_since_last_promotion  1614 non-null   int64
 4   years_with_current_manager  1614 non-null   int64
 5   same_as_monthly_income      771 non-null    float64
 6   date_birth                  1614 non-null   int64
 7   salary                      1614 non-null   float64
 8   role_departament            302 non-null    object
 9   number_children             0 non-null      float64
 10  remote_work                 1614 non-null   object
dtypes: float64(4), int64(4), object(3)
memory usage: 138.8+ KB

In [173]:
df_silvia.to_csv("seleccion_silvia_edit.csv", index=False)

In [174]:
df_silvia

,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_current_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,"3,0",20,NaN,15,15,19537.0,1972,1.000000e+09,NaN,NaN,True
1,"3,0",33,NaN,11,9,19999.0,1971,1.000000e+09,NaN,NaN,True
2,NaN,22,NaN,11,15,19232.0,1981,1.000000e+09,manager - research & development,NaN,True
3,NaN,20,NaN,5,6,17169.0,1976,1.000000e+09,NaN,NaN,False
4,"3,0",19,NaN,2,8,NaN,1977,1.000000e+09,NaN,NaN,False
...,...,...,...,...,...,...,...,...,...,...,...
1609,"3,0",16,NaN,3,7,10325.0,1987,1.000000e+09,NaN,NaN,False
1610,"2,0",9,NaN,0,8,4447.0,1978,1.000000e+09,NaN,NaN,True
1611,"3,0",8,NaN,0,7,NaN,1984,1.000000e+09,NaN,NaN,True
1612,"3,0",7,NaN,0,7,NaN,1987,1.000000e+09,NaN,NaN,True
1613,"3,0",8,NaN,0,7,10845.0,1977,1.000000e+09,NaN,NaN,False

In [40]:
# Cambiamos year_at_company de int--> a float

df_silvia["years_at_company"]=df_silvia["years_at_company"].astype(float)

In [41]:
df_silvia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   work_life_balance           1506 non-null   object
 1   years_at_company            1614 non-null   float64
 2   years_in_current_role       34 non-null     float64
 3   years_since_last_promotion  1614 non-null   int64
 4   years_with_current_manager  1614 non-null   int64
 5   same_as_monthly_income      771 non-null    float64
 6   date_birth                  1614 non-null   int64
 7   salary                      1614 non-null   float64
 8   role_departament            302 non-null    object
 9   number_children             0 non-null      float64
 10  remote_work                 1614 non-null   object
dtypes: float64(5), int64(3), object(3)
memory usage: 138.8+ KB

In [42]:

# Cambiamos work_life_balance de object a ---> int

df_silvia["work_life_balance"]=df_silvia["work_life_balance"].str.replace(',', '').astype(float)

In [43]:
df_silvia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   work_life_balance           1506 non-null   float64
 1   years_at_company            1614 non-null   float64
 2   years_in_current_role       34 non-null     float64
 3   years_since_last_promotion  1614 non-null   int64
 4   years_with_current_manager  1614 non-null   int64
 5   same_as_monthly_income      771 non-null    float64
 6   date_birth                  1614 non-null   int64
 7   salary                      1614 non-null   float64
 8   role_departament            302 non-null    object
 9   number_children             0 non-null      float64
 10  remote_work                 1614 non-null   object
dtypes: float64(6), int64(3), object(2)
memory usage: 138.8+ KB

In [45]:
df_silvia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   work_life_balance           1506 non-null   float64
 1   years_at_company            1614 non-null   float64
 2   years_in_current_role       34 non-null     float64
 3   years_since_last_promotion  1614 non-null   int64
 4   years_with_current_manager  1614 non-null   int64
 5   same_as_monthly_income      771 non-null    float64
 6   date_birth                  1614 non-null   int64
 7   salary                      1614 non-null   float64
 8   role_departament            302 non-null    object
 9   number_children             0 non-null      float64
 10  remote_work                 1614 non-null   object
dtypes: float64(6), int64(3), object(2)
memory usage: 138.8+ KB

In [55]:
df_silvia["work_life_balance"].unique()

array([30., nan, 20., 40., 10.])

In [44]:
df_silvia.to_csv("seleccion_silvia_edit.csv", index=False)